FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/СкидкиШапки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СкидкиШапки</Name>
			<Comment>Сведения о скидках назначаемых на документы в целом</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСкидки</Name>
					<Comment>Значение скидки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Comment>Действует или нет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособВычисления</Name>
					<Comment>Способ вычисления скидки (относительная/абсолютная)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СкидкиСпособВычисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагВытеснения</Name>
					<Comment>Флаг вытеснения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПрайсЛистаПодарка</Name>
					<Comment>Прайс-лист подарка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПрайсЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяСуммаПодарка</Name>
					<Comment>Максимальная сумма на которую можно сделать подарок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Момент последнего изменения скидки. Если момент больше чем "момент последней загрузки" оборудования, то эту скидку надо выгрузить в оборудование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСкидки</Name>
					<Comment>Идентификатор скидки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РегистраторСкидки</Name>
					<Comment>Ссылка на документ, установивший/отменивший данную скидку</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеСкидокШапки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РучнаяСкидка</Name>
					<Comment>Истина, если скидка задается в ручную. Ложь, если скидка автоматическая</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачВремя</Name>
					<Comment>Время начала действия скидки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонВремя</Name>
					<Comment>Время окончания действия скидки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДниНедели</Name>
					<Comment>Дни недели, когда действительна скидка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоПодарок</Name>
					<Comment>Истина, если скидка является подарком. Ложь, в противном случае</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Comment>Карта, на которую назначается скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтСуммыНакопленияНаКарте</Name>
					<Comment>Сумма накопительная, применяется совместно с дисконтной картой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалОбслуживания</Name>
					<Comment>Зал/Склад/Отдел в котором действует данная скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Свойство документа, от которого зависить скидка</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтСуммыЧека</Name>
					<Comment>Сумма, начиная с которой скидка имеет действие</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Comment>Скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкидкаНаТовары</Name>
					<Comment>Скидка на товары</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкидкаНаРаботы</Name>
					<Comment>Скидка на работы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/НазначениеСкидокШапки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НазначениеСкидокШапки</Name>
			<Comment>Назначение скидок на документ в целом</Comment>
			<BasedOn>
				<xr:Item>Document.НазначениеСкидокШапки</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс валюты документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйСкладскойОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалютыУпр</Name>
					<Comment>Курс валюты управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Comment>Дата начала действия цены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Comment>Дата операции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Скидки</Name>
					<Comment>Таблица скидок</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Comment>Скидка</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагВытеснения</Name>
							<Comment>Истина - скидка вытесняющая, Ложь - скидка может использоваться совместно</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСкидки</Name>
							<Comment>Процент от суммы документа или сумма для абсолютных скидок</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЧека</Name>
							<Comment>Сумма, начиная с которой скидка имеет действие</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Comment>Карта, на которую назначается скидка</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНакопления</Name>
							<Comment>Сумма накопительная, применяется совместно с дисконтной картой</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачВремя</Name>
							<Comment>Время начала действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонВремя</Name>
							<Comment>Время окончания действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДниНедели</Name>
							<Comment>Маска дней недели 0/1 для определения действия скидки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПрайсЛистаПодарка</Name>
							<Comment>Прайс-лист подарка</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПрайсЛистов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальнаяСуммаПодарка</Name>
							<Comment>Максимальная сумма подарка</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладКомпании</Name>
							<Comment>Склад/Отдел</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСкидки</Name>
							<Comment>Идентификатор скидки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаНаТовары</Name>
							<Comment>Скидка на товары</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаНаРаботы</Name>
							<Comment>Скидка на работы</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/СкидкиШапки/Ext/RecordSetModule.bsl
// Модуль набора записей регистра "СкидкиШапки"

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем ДокументОбъект			Экспорт;	// Документ объект
Перем РезультатЗапросаПоСкидкам	Экспорт;	// РезультатЗапроса или ТаблицаЗначений.
Перем ПодразделениеКомпании		Экспорт;	// Подразделение компании

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Функция выполняет отмену проведения
Функция ОтменаПроведения() Экспорт
	// проверим значения ключевых объектов
	Отказ = ((ТипЗнч(ДокументОбъект) <> Тип("ДокументОбъект.НазначениеСкидокШапки")) ИЛИ ДокументОбъект.ЭтоНовый());
	
	// приступим к очистки движений
	Если НЕ Отказ Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.СкидкиШапки КАК СкидкиШапки
		|ГДЕ
		|	СкидкиШапки.РегистраторСкидки = &РегистраторСкидки";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("РегистраторСкидки", ДокументОбъект.Ссылка);
		
		Запись = РегистрыСведений.СкидкиШапки.СоздатьМенеджерЗаписи();
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Попытка
				Запись.Прочитать();
				Запись.Удалить();
			Исключение
				Отказ = ИСТИНА;
			КонецПопытки;
		КонецЦикла;
	КонецЕсли; 
	
	Возврат Отказ;
КонецФункции

// Установить скидки
Функция УстановитьСкидки() Экспорт
	Отказ = ЛОЖЬ;
	
	// проверим значения ключевых объектов
	Если (ТипЗнч(ДокументОбъект) <> Тип("ДокументОбъект.НазначениеСкидокШапки")) ИЛИ ДокументОбъект.ЭтоНовый() Тогда
		Отказ = ИСТИНА;
	КонецЕсли;
	Если (ТипЗнч(ПодразделениеКомпании) <> Тип("СправочникСсылка.ПодразделенияКомпании")) ИЛИ ПодразделениеКомпании.Пустая() Тогда
		Отказ = ИСТИНА;
	КонецЕсли;
	
	// получаем таблицу товаров
	Если (РезультатЗапросаПоСкидкам = Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоСкидкам)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоСкидкам)<>Тип("ТаблицаЗначений")) Тогда
		Отказ = ИСТИНА;
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоСкидкам) = Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоСкидкам = РезультатЗапросаПоСкидкам.Выгрузить();
	КонецЕсли;
	
	// если были обнаружены ошибки, то движения делать не будем
	Если НЕ Отказ Тогда
		ТабЗаписей = ПолучитьДаныеПоСкидкам(ДокументОбъект.Ссылка);
		НужнаПроверка = ТабЗаписей.Количество() > 0;
		стрОшибок = "";
		
		// Осуществляем запись данных в регистр
		Для Каждого ТекСтрока Из РезультатЗапросаПоСкидкам Цикл
			
			// регистр СкидкиШапки 
			НоваяЗапись = Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСтрока);
			НоваяЗапись.Период				= ДокументОбъект.ДатаНачалаДействия;
			НоваяЗапись.Подразделение		= ПодразделениеКомпании;
			НоваяЗапись.Действует			= ИСТИНА;
			НоваяЗапись.РегистраторСкидки	= ДокументОбъект.Ссылка;
			НоваяЗапись.Свойство			= ?(обЗначениеНеЗаполнено(НоваяЗапись.Свойство), Неопределено, НоваяЗапись.Свойство);
			НоваяЗапись.ИдентификаторСкидки	= ТекСтрока.ИдентификаторСкидки; 
			НоваяЗапись.СкидкаНаТовары		= ТекСтрока.СкидкаНаТовары; 
			НоваяЗапись.СкидкаНаРаботы		= ТекСтрока.СкидкаНаРаботы; 
			НоваяЗапись.МоментИзменения		= ТекущаяДата(); 
			НоваяЗапись.РучнаяСкидка		= ТекСтрока.Скидка.РучнаяСкидка;
			
			// проверим возможность добавления строки
			Если НужнаПроверка Тогда
				стрПоиск = Новый Структура;
				стрПоиск.Вставить("Подразделение");
				стрПоиск.Вставить("РучнаяСкидка");
				стрПоиск.Вставить("НачВремя");
				стрПоиск.Вставить("КонВремя");
				стрПоиск.Вставить("ДниНедели");
				стрПоиск.Вставить("ЭтоПодарок");
				стрПоиск.Вставить("ДисконтнаяКарта");
				стрПоиск.Вставить("ОтСуммыНакопленияНаКарте");
				стрПоиск.Вставить("ЗалОбслуживания");
				стрПоиск.Вставить("Свойство");
				стрПоиск.Вставить("ОтСуммыЧека");
				стрПоиск.Вставить("Скидка");
				стрПоиск.Вставить("СкидкаНаТовары");
				стрПоиск.Вставить("СкидкаНаРаботы");
				
				ЗаполнитьЗначенияСвойств(стрПоиск,НоваяЗапись);
				
				РезПоиска = ТабЗаписей.НайтиСтроки(стрПоиск);
				Если РезПоиска.Количество() > 0 Тогда
					Отказ = Истина;
					дкДобавитьОшибку(стрОшибок, "Для скидки <"+ТекСтрока.Скидка+"> уже есть запись на дату """+ Формат(ДокументОбъект.ДатаНачалаДействия,"ДЛФ=DDT") +""".");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// Произведем запись набора (т.к. автоматической записи по окончанию транзакции не будет)
		Если Отказ Тогда
			дкСообщитьРезультат(стрОшибок, "Важное&Скидки (на документ в целом):", ДокументОбъект);//ОписаниеОшибки()
		Иначе
			Попытка
				Записать(ЛОЖЬ);
			Исключение
				Отказ = ИСТИНА;
				дкСообщитьРезультат("В процессе записи данных в регистр возникла ошибка.", "Важное&Скидки (на документ в целом):", ДокументОбъект);//ОписаниеОшибки()
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	// Очистим основные переменные
	ДокументОбъект				= Неопределено;
	РезультатЗапросаПоСкидкам	= Неопределено;
	ПодразделениеКомпании		= Неопределено;
	
	Возврат Отказ;
КонецФункции

// Отменить скидки
Функция ОтменитьСкидки() Экспорт
	Отказ = ЛОЖЬ;
	
	// проверим значения ключевых объектов
	Если (ТипЗнч(ДокументОбъект) <> Тип("ДокументОбъект.НазначениеСкидокШапки")) ИЛИ ДокументОбъект.ЭтоНовый() Тогда
		Отказ = ИСТИНА;
	КонецЕсли;
	Если (ТипЗнч(ПодразделениеКомпании) <> Тип("СправочникСсылка.ПодразделенияКомпании")) ИЛИ ПодразделениеКомпании.Пустая() Тогда
		Отказ = ИСТИНА;
	КонецЕсли;
	
	// получаем таблицу товаров
	Если (РезультатЗапросаПоСкидкам = Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоСкидкам)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоСкидкам)<>Тип("ТаблицаЗначений")) Тогда
		Отказ = ИСТИНА;
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоСкидкам) = Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоСкидкам = РезультатЗапросаПоСкидкам.Выгрузить();
	КонецЕсли;
	
	// Осуществляем запись данных в регистр
	Для Каждого ТекСтрока Из РезультатЗапросаПоСкидкам Цикл
		Если НЕ ТекСтрока.СкидкаУстановлена Тогда
			Отказ = ИСТИНА;
			дкСообщитьРезультат("Скидка """+СокрЛП(ТекСтрока.Скидка)+""" ранее не была установлена. Отмена скидки не возможно!", "Важное&Скидки (на документ в целом):", ДокументОбъект, ТекСтрока.Скидка);
			Продолжить;
		КонецЕсли;
		
		// регистр СкидкиШапки 
		НоваяЗапись = Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСтрока);
		НоваяЗапись.Период				= ДокументОбъект.ДатаНачалаДействия;
		НоваяЗапись.Подразделение		= ПодразделениеКомпании;
		НоваяЗапись.Действует			= ЛОЖЬ;
		НоваяЗапись.РегистраторСкидки	= ДокументОбъект.Ссылка;
		НоваяЗапись.ИдентификаторСкидки = ТекСтрока.ИдентификаторСкидки; //TruA
		НоваяЗапись.СкидкаНаТовары		= ТекСтрока.СкидкаНаТовары;
		НоваяЗапись.СкидкаНаРаботы		= ТекСтрока.СкидкаНаРаботы;
		НоваяЗапись.МоментИзменения		= ТекущаяДата(); //TruA
	КонецЦикла;
	
	// если были обнаружены ошибки, то движения записывать не будем
	Если НЕ Отказ Тогда
		// Произведем запись набора (т.к. автоматической записи по окончанию транзакции не будет)
		Попытка
			Записать(ЛОЖЬ);
		Исключение
			Отказ = ИСТИНА;
			дкСообщитьРезультат("В процессе записи данных в регистр возникла ошибка.", "Важное&Скидки (на документ в целом):", ДокументОбъект);//ОписаниеОшибки()
		КонецПопытки;
	КонецЕсли;
	
	// Очистим основные переменные
	ДокументОбъект				= Неопределено;
	РезультатЗапросаПоСкидкам	= Неопределено;
	ПодразделениеКомпании		= Неопределено;
	
	Возврат Отказ;
КонецФункции

// получение скидок на дату
Функция ПолучитьДаныеПоСкидкам(ДокСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СкидкиШапки.Подразделение,
	|	СкидкиШапки.РучнаяСкидка,
	|	СкидкиШапки.НачВремя,
	|	СкидкиШапки.КонВремя,
	|	СкидкиШапки.ДниНедели,
	|	СкидкиШапки.ЭтоПодарок,
	|	СкидкиШапки.ДисконтнаяКарта,
	|	СкидкиШапки.ОтСуммыНакопленияНаКарте,
	|	СкидкиШапки.ЗалОбслуживания,
	|	СкидкиШапки.ОтСуммыЧека,
	|	СкидкиШапки.Скидка,
	|	СкидкиШапки.СкидкаНаТовары,
	|	СкидкиШапки.СкидкаНаРаботы,
	|	СкидкиШапки.Свойство
	|ИЗ
	|	РегистрСведений.СкидкиШапки КАК СкидкиШапки
	|ГДЕ
	|	СкидкиШапки.Скидка В
	|			(ВЫБРАТЬ
	|				НазначениеСкидокШапкиСкидки.Скидка
	|			ИЗ
	|				Документ.НазначениеСкидокШапки.Скидки КАК НазначениеСкидокШапкиСкидки
	|			ГДЕ
	|				НазначениеСкидокШапкиСкидки.Ссылка = &ДокСсылка
	|			СГРУППИРОВАТЬ ПО
	|						НазначениеСкидокШапкиСкидки.Скидка)
	|	И СкидкиШапки.Период = &ДатаНачалаДействия";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.УстановитьПараметр("ДатаНачалаДействия",ДокСсылка.ДатаНачалаДействия);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
